public/benchmarks/20260228_023311/run_variant_a_20260228_023311.txt
/opt/homebrew/bin/java  -classpath /Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/conf:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/HdrHistogram-2.1.12.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/bsh-2.0b4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/core-0.18.0-shivam-SNAPSHOT.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/htrace-core4-4.1.0-incubating.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/jackson-core-asl-1.9.4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/jackson-mapper-asl-1.9.4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/jcommander-1.12.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/junit-3.8.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/snakeyaml-1.6.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/testng-6.1.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-accessanalyzer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-acm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-acmpca-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-alexaforbusiness-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-amplify-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-api-gateway-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-apigatewaymanagementapi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-apigatewayv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appconfig-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-applicationautoscaling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-applicationinsights-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appmesh-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appstream-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appsync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-athena-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-augmentedairuntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-autoscaling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-autoscalingplans-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-backup-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-batch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-budgets-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-chime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloud9-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-clouddirectory-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudformation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudfront-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudhsm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudhsmv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudsearch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudtrail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudwatch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudwatchmetrics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codeartifact-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codebuild-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codecommit-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codedeploy-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codeguruprofiler-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codegurureviewer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codepipeline-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codestar-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codestarconnections-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codestarnotifications-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cognitoidentity-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cognitoidp-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cognitosync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-comprehend-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-comprehendmedical-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-computeoptimizer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-config-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-connect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-connectparticipant-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-core-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-costandusagereport-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-costexplorer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dataexchange-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-datapipeline-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-datasync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dax-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-detective-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-devicefarm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-directconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-directory-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-discovery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dlm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-docdb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dynamodb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ebs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ec2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ec2instanceconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ecr-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ecs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-efs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-eks-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticache-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticbeanstalk-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticinference-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticloadbalancing-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticloadbalancingv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticsearch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elastictranscoder-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-emr-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-eventbridge-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-events-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-fms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-forecast-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-forecastquery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-frauddetector-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-fsx-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-gamelift-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-glacier-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-globalaccelerator-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-glue-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-greengrass-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-groundstation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-guardduty-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-health-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-honeycode-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iam-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-imagebuilder-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-importexport-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-inspector-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iot-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iot1clickdevices-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iot1clickprojects-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotanalytics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotevents-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ioteventsdata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotjobsdataplane-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotsecuretunneling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotsitewise-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotthingsgraph-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kafka-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kendra-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesis-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesisanalyticsv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesisvideo-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesisvideosignalingchannels-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lakeformation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lambda-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lex-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lexmodelbuilding-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-licensemanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lightsail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-logs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-machinelearning-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-macie-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-macie2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-managedblockchain-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplacecatalog-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplacecommerceanalytics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplaceentitlement-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplacemeteringservice-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mechanicalturkrequester-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediaconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediaconvert-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-medialive-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediapackage-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediapackagevod-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediastore-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediastoredata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediatailor-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-migrationhub-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-migrationhubconfig-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mobile-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-models-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mq-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-neptune-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-networkmanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-opsworks-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-opsworkscm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-organizations-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-outposts-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-personalize-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-personalizeevents-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-personalizeruntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pinpoint-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pinpointemail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pinpointsmsvoice-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-polly-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pricing-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-qldb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-qldbsession-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-quicksight-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ram-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-rds-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-rdsdata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-redshift-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-rekognition-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-resourcegroups-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-resourcegroupstaggingapi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-robomaker-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-route53-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-route53resolver-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-s3-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-s3control-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sagemaker-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sagemakerruntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-savingsplans-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-schemas-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-secretsmanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-securityhub-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-serverlessapplicationrepository-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servermigration-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servicecatalog-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servicediscovery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servicequotas-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ses-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sesv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-shield-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-signer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-simpledb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-simpleworkflow-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-snowball-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sns-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sqs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ssm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sso-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ssooidc-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-stepfunctions-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-storagegateway-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sts-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-support-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-swf-libraries-1.11.22.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-synthetics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-textract-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-transcribe-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-transfer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-translate-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-waf-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-wafv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workdocs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-worklink-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workmail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workmailmessageflow-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workspaces-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-xray-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/commons-codec-1.11.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/commons-logging-1.1.3.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/dynamodb-binding-0.18.0-shivam-SNAPSHOT.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/httpclient-4.5.9.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/httpcore-4.4.11.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/ion-java-1.0.2.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-annotations-2.6.0.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-core-2.6.7.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-databind-2.6.7.3.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-dataformat-cbor-2.6.7.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jmespath-java-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/joda-time-2.8.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/log4j-1.2.17.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-buffer-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-codec-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-codec-http-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-common-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-handler-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-resolver-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-transport-4.1.44.Final.jar site.ycsb.Client -t -db site.ycsb.db.DynamoDBClient -P ./workloads/variant_a -p dynamodb.endpoint=http://localhost:8787/api -p dynamodb.primaryKey=PK -p dynamodb.primaryKeyType=HASH -p dynamodb.awsCredentialsFile=fake-aws-credentials.properties -s
Command line: -t -db site.ycsb.db.DynamoDBClient -P ./workloads/variant_a -p dynamodb.endpoint=http://localhost:8787/api -p dynamodb.primaryKey=PK -p dynamodb.primaryKeyType=HASH -p dynamodb.awsCredentialsFile=fake-aws-credentials.properties -s
YCSB Client 0.18.0-shivam-SNAPSHOT

Loading workload...
Starting test.
2026-02-28 02:33:29:799 0 sec: 0 operations; est completion in 0 second 
0    [Thread-8] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-2] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-5] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
0    [Thread-3] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-6] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-9] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-7] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-4] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
2026-02-28 02:33:39:730 10 sec: 2359 operations; 235.85 current ops/sec; est completion in 1 minute [READ: Count=907, Max=197887, Min=3926, Avg=28075.59, 50=23087, 90=46239, 99=137727, 99.9=197887, 99.99=197887] [UPDATE: Count=970, Max=199679, Min=4496, Avg=31291.63, 50=25263, 90=51679, 99=153215, 99.9=199679, 99.99=199679] [INSERT: Count=483, Max=199679, Min=4768, Avg=31878.41, 50=26559, 90=57055, 99=105727, 99.9=199679, 99.99=199679] 
2026-02-28 02:33:49:729 20 sec: 6279 operations; 392.04 current ops/sec; est completion in 1 minute [READ: Count=1601, Max=228223, Min=4092, Avg=19864.16, 50=14031, 90=33023, 99=109695, 99.9=219647, 99.99=228223] [UPDATE: Count=1533, Max=233471, Min=3004, Avg=20742.91, 50=15199, 90=36383, 99=87679, 99.9=224255, 99.99=233471] [INSERT: Count=785, Max=195839, Min=3968, Avg=20722.84, 50=15615, 90=36767, 99=105855, 99.9=195839, 99.99=195839] 
2026-02-28 02:33:59:729 30 sec: 10288 operations; 400.94 current ops/sec; est completion in 58 seconds [READ: Count=1621, Max=343295, Min=3180, Avg=18797.43, 50=13927, 90=34271, 99=68735, 99.9=289535, 99.99=343295] [UPDATE: Count=1592, Max=311295, Min=2552, Avg=20764.02, 50=15703, 90=37951, 99=88063, 99.9=304895, 99.99=311295] [INSERT: Count=798, Max=343551, Min=2938, Avg=20576.34, 50=15191, 90=36415, 99=68223, 99.9=343551, 99.99=343551] 
2026-02-28 02:34:09:730 40 sec: 16042 operations; 575.28 current ops/sec; est completion in 35 seconds [READ: Count=2232, Max=115903, Min=2862, Avg=13227.77, 50=10367, 90=21391, 99=53855, 99.9=104767, 99.99=115903] [UPDATE: Count=2372, Max=119039, Min=3336, Avg=14364.9, 50=11535, 90=23071, 99=53695, 99.9=112639, 99.99=119039] [INSERT: Count=1148, Max=119935, Min=2244, Avg=14271.45, 50=11727, 90=22639, 99=51039, 99.9=101183, 99.99=119935] 
2026-02-28 02:34:19:731 50 sec: 21306 operations; 526.4 current ops/sec; est completion in 21 seconds [READ: Count=2116, Max=237439, Min=2564, Avg=14524.74, 50=10991, 90=23247, 99=57279, 99.9=176383, 99.99=237439] [UPDATE: Count=2070, Max=190975, Min=3030, Avg=15645.54, 50=12399, 90=24495, 99=54847, 99.9=78975, 99.99=190975] [INSERT: Count=1078, Max=219391, Min=3182, Avg=15588.38, 50=12655, 90=24735, 99=50143, 99.9=72511, 99.99=219391] 
2026-02-28 02:34:29:732 60 sec: 25240 operations; 393.36 current ops/sec; est completion in 12 seconds [READ: Count=1544, Max=215423, Min=3024, Avg=19236.01, 50=13095, 90=39967, 99=78271, 99.9=179071, 99.99=215423] [UPDATE: Count=1583, Max=239103, Min=3626, Avg=21372.56, 50=14703, 90=39359, 99=102207, 99.9=236415, 99.99=239103] [INSERT: Count=810, Max=114495, Min=3278, Avg=20327.76, 50=14871, 90=36607, 99=78911, 99.9=114495, 99.99=114495] 
2026-02-28 02:34:38:996 69 sec: 30000 operations; 513.82 current ops/sec; [READ: Count=1878, Max=117631, Min=2436, Avg=14832.45, 50=10791, 90=26815, 99=70335, 99.9=94207, 99.99=117631] [CLEANUP: Count=8, Max=1, Min=0, Avg=0.38, 50=0, 90=1, 99=1, 99.9=1, 99.99=1] [UPDATE: Count=1906, Max=117759, Min=2664, Avg=15900.43, 50=12143, 90=27103, 99=67071, 99.9=96767, 99.99=117759] [INSERT: Count=973, Max=74687, Min=2678, Avg=15376.53, 50=12031, 90=26831, 99=53407, 99.9=74687, 99.99=74687] 
[OVERALL], RunTime(ms), 69267
[OVERALL], Throughput(ops/sec), 433.106674173849
[TOTAL_GCS_G1_Young_Generation], Count, 12
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 98
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.14148151356345734
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 12
[TOTAL_GC_TIME], Time(ms), 98
[TOTAL_GC_TIME_%], Time(%), 0.14148151356345734
[READ], Operations, 11899
[READ], AverageLatency(us), 17274.74434826456
[READ], MinLatency(us), 2436
[READ], MaxLatency(us), 343295
[READ], 50thPercentileLatency(us), 12039
[READ], 90thPercentileLatency(us), 32159
[READ], 95thPercentileLatency(us), 43231
[READ], 99thPercentileLatency(us), 78847
[READ], 99.9PercentileLatency(us), 198911
[READ], Return=OK, 11899
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 0.375
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1
[CLEANUP], 50thPercentileLatency(us), 0
[CLEANUP], 90thPercentileLatency(us), 1
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 1
[CLEANUP], 99.9PercentileLatency(us), 1
[UPDATE], Operations, 12026
[UPDATE], AverageLatency(us), 18776.557957758192
[UPDATE], MinLatency(us), 2552
[UPDATE], MaxLatency(us), 311295
[UPDATE], 50thPercentileLatency(us), 13407
[UPDATE], 90thPercentileLatency(us), 34431
[UPDATE], 95thPercentileLatency(us), 45439
[UPDATE], 99thPercentileLatency(us), 82879
[UPDATE], 99.9PercentileLatency(us), 199423
[UPDATE], Return=OK, 12026
[INSERT], Operations, 6075
[INSERT], AverageLatency(us), 18551.335637860084
[INSERT], MinLatency(us), 2244
[INSERT], MaxLatency(us), 343551
[INSERT], 50thPercentileLatency(us), 13511
[INSERT], 90thPercentileLatency(us), 34207
[INSERT], 95thPercentileLatency(us), 43999
[INSERT], 99thPercentileLatency(us), 75135
[INSERT], 99.9PercentileLatency(us), 176255
[INSERT], Return=OK, 6075